TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0C1104/driverlib/timx_timer_mode_pwm_edge_sleep_shadow/timx_timer_mode_pwm_edge_sleep_shadow.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 */
// @cliArgs --device "MSPM0C110X" --package "VSSOP-20(DGS20)" --part "Default"
// @cliArgs --board /ti/boards/LP_MSPM0C1104 --rtos nortos

/**
 * Import the modules used in this configuration.
 */
const PWM    = scripting.addModule("/ti/driverlib/PWM", {}, false);
const PWM1   = PWM.addInstance();
const SYSCTL = scripting.addModule("/ti/driverlib/SYSCTL");

/**
 * Write custom configuration values to the imported modules.
 */
PWM1.dbRiseDelayTimerCount      = 50;
PWM1.dbFallDelayTimerCount      = 25;
PWM1.$name                      = "PWM_0";
PWM1.ccIndex                    = [0];
PWM1.clockSource                = "MFCLK";
PWM1.clockPrescale              = 4;
PWM1.timerCount                 = 1600;
PWM1.enableShadowLoad           = true;
PWM1.interrupts                 = ["CC0_DN_EVENT"];
PWM1.peripheral.$assign         = "TIMA0";
PWM1.peripheral.ccp0Pin.$assign = "PA2";
PWM1.PWM_CHANNEL_0.$name        = "ti_driverlib_pwm_PWMTimerCC0";
PWM1.PWM_CHANNEL_0.ccValue      = 799;
PWM1.PWM_CHANNEL_0.shadowUpdateMode = "ZERO_EVT";

const Board = scripting.addModule("/ti/driverlib/Board", {}, false);

SYSCTL.MFCLKEn = true;
